# Вероятно, я не очень понял задание, но написанный мной код отрабатывает как следует.
# Одно слово и несколько печатаются с заглавной буквы.
# Если что-то неправильно, пожалуйста, напишите мне и дайте возможность исправиться.


def capitalizator(a1):
    """
    Превращает первые буквы каждого слова в заглавную

    :param a1: слово или строка
    :return: печать слова или каждого слова строки с заглавной буквы
    """
    a1 = int(a1)
    return print(a1)


text = input('Введите какой-нибудь текст: ')

capitalizator(text)
