# 2. Для списка реализовать обмен значений соседних элементов, т.е.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

a = input('Введите значение а: ')
b = input('Введите значение b: ')
c = input('Введите значение c: ')
d = input('Введите значение d: ')
e = input('Введите значение e: ')
f = input('Введите значение f: ')
g = input('Введите значение g: ')
h = input('Введите значение h: ')
j = input('Введите значение j: ')

x_list = [a, b, c, d, e, f, g, h, j]
y_list = [b, a, d, c, f, e, h, g, j]

print(y_list)


