# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

# Поставлю ограничение на 20 оценок, чтобы не допустить бесконечного цикла.
# создание списка
rating = []
# запуск цикла
s = 0
while s < 20:
    a = int(input('Введите оценку: '))
    rating.insert(0, a)
    rating.sort()
    rating.reverse()
    s += 1
    print('Результат: ', str(rating)[1:-1])