# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

a = 100
b = 400
c = 1000
d = 1024
e = 2
f = 7
k = 2.5
l = -7.25

g = 'Привет,'
h = 'Мир!'

i = True
j = False

m = ['нет', 'да', 'не знаю']
n = [10, 20, 30, 40, 50]

name = input('Как Вас зовут?')
age = int(input('Введите Ваш возраст:'))
phone = input('Введите Ваш номер телефона:')

print('Сумма 100+400=', a + b)
print('1000/', a + b, '=', c / (a + b))
print("2 в 10 степени равно ", e ** 10)
print(g + h)
print("Итак, Вас зовут ", name, '. Вам ', age, '. Связаться с Вами можно по телефону', phone)
